tuts/1DNHPTNH3Simulations-c559d467edef6f5c10644fb41f1c4c7d9278721e/CASES/2.FormalSimulations/1D_NH3_NHPT_ConstV/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0    -0.0002 -0.0002)//0
    (0.02 -0.0002 -0.0002)//1
    (0.02  0.0002 -0.0002)//2
    (0     0.0002 -0.0002)//3
    (0    -0.0002  0.0002)//4
    (0.02 -0.0002  0.0002)//5
    (0.02  0.0002  0.0002)//6
    (0     0.0002  0.0002)//7


    (0.03 -0.0002 -0.0002)//8
    (0.03  0.0002 -0.0002)//9
    (0.03 -0.0002  0.0002)//10
    (0.03  0.0002  0.0002)//11
);

blocks
(
    hex (0 1 2 3 4 5 6 7)   (2000 1 1) simpleGrading (1 1 1)
    hex (1 8 9 2 5 10 11 6) (1000 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    empty
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (1 2 9 8)
            (5 10 11 6)
        );
    }
    right
    {
        type patch;
        faces
        (
            (9 11 10 8)
        );
    }
    top
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (2 6 11 9)
        );
    }
    left
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    bottom
    {
        type patch;
        faces
        (
            (1 5 4 0)
            (8 10 5 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
